tutorials/chtMultiRegion4PCMFoam/thermoelectricGenerator/constant/TEG/thermoelectricGenerator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      TEG;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
TEGPatcheNames
(
    top
    TEG_to_PCM
);

ZT		ZT [0 0 0 0 0 0 0]		1.2;
// ************************************************************************* //
